using System;
namespace _17NSJ.Constants
{
    public static class AgreementArticles
    {
        public static readonly string BeforeArticle = $"本規約は、公益財団法人ボーイスカウト日本連盟（以下、「本連盟」といいます。）が提供するスマートフォン用アプリケーション「第１７回日本スカウトジャンボリー公式アプリ」（以下、「本アプリケーション」といいます。）およびこれに付帯関連するサービス（以下、これらを総称して「本サービス」といいます。）のすべての利用者（以下、「利用者」といいます。）と本連盟との関係を定めるものです。{Environment.NewLine}本サービスは、本規約の全条項をお読みいただき、内容をご理解いただいたうえでご利用ください。{Environment.NewLine}本規約に同意いただけない利用者は、本サービスをご利用いただけませんので、本アプリケーションを削除（アンインストール）してください。利用者が本サービスを利用された場合には、その時点で本規約に同意いただいたものとみなします。";
        public static readonly string Article1 = $"本規約は、本サービスの提供条件および本サービスの利用に関する、本連盟と利用者との間に発生する権利・義務を定めることを目的とし、本サービスのすべてに適用されるものとします。";
        public static readonly string Article2 = $"1. 本サービスに関する一切の権利（所有権、商標権・著作権・意匠権等の知的財産権、肖像権、パブリシティー権等）は本連盟または当該権利を有する第三者に帰属しています。{Environment.NewLine}2. 利用者は、所有権、知的財産権、肖像権、パブリシティー権等、本サービスに関する一切の権利を侵害する行為（本サービスの複製、翻案、編集、改変、公衆送信等を含みます。）をしてはならないものとします。{Environment.NewLine}3. 前項の規定に違反して権利侵害等の問題が発生した場合、利用者は、自己の負担と責任においてかかる問題を解決するものとします。利用者が仮に本連盟に損害を与えた場合は、本連盟に対して当該損害のすべてを賠償していただきます。";
        public static readonly string Article3 = $"利用者は、前条に定めるもののほかに、本サービスの利用にあたって、以下の行為またはそのおそれがある行為を行ってはならないものとします。{Environment.NewLine}① 法令に違反する行為{Environment.NewLine}② 他の利用者、本連盟または第三者に不利益または損害を与える行為{Environment.NewLine}③ 公序良俗に反する行為{Environment.NewLine}④ 本サービスのネットワークまたはシステム等に過度な負荷をかける行為{Environment.NewLine}⑤ 本連盟による本サービスの運営を妨害する行為{Environment.NewLine}⑥ 本サービスの信用を失墜、毀損させる行為{Environment.NewLine}⑦ 本連盟の承認した以外の方法で本サービスを利用する行為{Environment.NewLine}⑧ 本サービスを逆アセンブラ、逆コンパイラ、リバースエンジニアリングする行為{Environment.NewLine}⑨ その他、本連盟が不適切と判断する行為{Environment.NewLine}";
        public static readonly string Article4 = $"1. 本連盟は、理由の如何を問わず、利用者に事前に通知することなく、本サービスの内容を変更する、もしくは提供を停止または中断することができるものとします。{Environment.NewLine}2. 本連盟は、前項に基づき本連盟が行った措置に起因して、利用者または第三者に損害が生じた場合であっても、一切の責任を負わないものとします。";
        public static readonly string Article5 = $"1. 本連盟は、本サービスが利用者の特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、および不具合が生じないことについて、保証するものではありません。{Environment.NewLine}2. 利用者の端末機器環境または通信環境等その他の理由によって、本サービスが正常に利用できない場合においても、これにより利用者に生じた損害・不利益について、本連盟は一切の責任を負わないものとします。{Environment.NewLine}3. 本サービスのご利用に起因して、利用者の端末機器がコンピュータウィルス等に感染するなどし、データの滅失・毀損等が発生して利用者に損害・不利益が生じた場合であっても、本連盟は一切の責任を負わないものとします。{Environment.NewLine}4. 本サービスのご利用に起因して、利用者間または利用者と第三者間において紛争その他の問題が発生し、利用者に損害・不利益が生じた場合であっても、本連盟は一切の責任を負わないものとします。{Environment.NewLine}5．プログラム待ち時間の表示等本サービスに関して、実際と異なることがあります。これに対し利用者に損害・不利益が生じた場合であっても、本連盟は一切の責任を負わないものとします。{Environment.NewLine}";
        public static readonly string Article6 = $"本連盟による利用者の利用者情報の取り扱いについては、別途、本連盟プライバシーポリシー（以下、「本プライバシーポリシー」といいます。）の定めによるものとし、利用者は本プライバシーポリシーに従って、本連盟が利用者情報を取り扱うことに同意するものとします。";
        public static readonly string Article7 = $"本連盟は、随時、本規約を改訂することができるものとします。本連盟は本規約を改訂した場合、その都度、改訂後の本規約を本サービスの「設定」画面に掲示することによって利用者に告知するものとし、改訂後の本規約は掲示をした時点で効力を生じるものとします。また、利用者が当該掲示後に本サービスを利用された場合は、改訂後の本規約に同意いただいたものとみなします。";
        public static readonly string Article8 = $"1. 利用者は、本連盟の書面による事前の承諾なく、本規約に基づく権利または義務につき、第三者に対し、譲渡、移転、担保設定、その他の処分をすることはできません。{Environment.NewLine}2. 本連盟は、本サービスにかかる事業を他（本連盟の関連を含みます。）に譲渡した場合には、当該事業譲渡に伴い利用契約上の地位、本規約に基づく権利および義務ならびに利用者情報を譲受人に譲渡することができるものとし、利用者は、かかる譲渡につき本項においてあらかじめ同意したものとします。なお、本項に定める事業譲渡には、通常の事業譲渡の他、分割その他事業が移転するなどあらゆる場合を含むものとします。";
        public static readonly string Article9 = $"本規約のいずれかの条項またはその一部が、消費者契約法その他の法令等により無効または執行不能と判断された場合であっても、本規約の残りの規定および一部が無効または執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。";
        public static readonly string Article10 = $"1. 本規約の準拠法は、日本国法とします。{Environment.NewLine}2. 本サービスに関連する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。";
    }
}
