using System;
namespace _17NSJ.Constants
{
    public static class PolicyArticles
    {
        public static readonly string Article1 = $"このアプリケーション・プライバシーポリシー（以下、「本プライバシーポリシー」といいます。）は、公益財団法人ボーイスカウト日本連盟（以下、「本連盟」といいます。）が提供するスマートフォン用アプリケーション「第17回日本スカウトジャンボリー公式アプリ」（以下、「本アプリケーション」といいます。）およびこれに付帯関連するサービス（以下、これらを総称して「本サービス」といいます。）における利用者情報の取り扱いを定めたものです。なお、本連盟の連絡先は、第１１条をご覧ください。";
        public static readonly string Article2 = $"本サービスのご利用に際して、以下の利用者情報を以下の利用目的のためにアプリケーション経由で自動的に取得いたします。{Environment.NewLine}①本連盟または本連盟の委託機関が企画・制作する事業のサービス向上を図る目的で、本アプリケーションに限りユーザー行動の情報を取得、保存します。{Environment.NewLine}②今後のアプリケーションの安定性向上のため、クラッシュレポートを収 集します。{Environment.NewLine}③アンケートについて。";
        public static readonly string Article3 = $"1.本サービスは、本プライバシーポリシーを確認し、内容を理解いただいたうえでご利用ください。本サービスの利用規約および本プライバシーポリシーは「設定」画面に掲示され、この掲示をもって利用者に通知したものとします。{Environment.NewLine}2.利用規約および本プライバシーポリシーに同意いただけない場合には、本サービスをご利用いただけません。利用者が本サービスを利用された場合には、その時点で利用規約および本プライバシーポリシーに同意いただいたものとみなします。";
        public static readonly string Article4 = $"1.第２条に基づき取得された情報を外部送信することはありません。{Environment.NewLine}2.第２条に基づき取得された情報を、利用者の同意を得ることなく、本連盟および第17回日本スカウトジャンボリーの運営機関外へ提供することはありません。ただし、個人識別性を獲得しえない匿名化された情報を統計処理した結果については、本連盟の委託機関を含む第三者に提供する場合があります。";
        public static readonly string Article5 = $"利用者が、利用者情報の利用停止を希望する場合、本アプリケーションを削除（アンインストール）する必要があります。";
        public static readonly string Article6 = $"利用者が、本アプリケーションを削除（アンインストール）する機能を利用して端末より削除（アンインストール）された場合、本アプリケーションに関する情報は端末よりただちに削除されます。なお、サーバーに蓄積された端末の基礎情報および本アプリケーション内での行動情報は、個人識別性を獲得しえない形での保管を継続します。";
        public static readonly string Article7 = $"本連盟の個人情報保護方針は、下記のリンクよりご確認ください。本個人情報保護方針と本プライバシーポリシーが異なる場合、本プライバシーポリシーが優先されるものとします。{Environment.NewLine}{Environment.NewLine}本連盟の個人情報保護方針のリンク先{Environment.NewLine}https://www.scout.or.jp/privacy.html";
        public static readonly string Article8 = $"本連盟は、随時、本プライバシーポリシーを改訂することができるものとします。本プライバシーポリシーを改訂した場合、その都度、改訂後の本プライバシーポリシーを本サービスの「設定」画面に掲示することによって利用者に通知するものとし、改訂後の本プライバシーポリシーは、掲示した時点で効力を生じるものとします。利用者が、当該掲示後に本サービスを利用された場合は、改訂後の本プライバシーポリシーに同意いただいたものとみなします。";
        public static readonly string Article9 = $"本連盟は、利用者の同意を得ることなく、本サービスにて取得、保存した利用者情報を、本プライバシーポリシーに明示している第三者以外に開示または提示することはありません。ただし、以下の場合は除きます。{Environment.NewLine}①法令に基づく場合{Environment.NewLine}②人の生命、身体または財産の保護のために必要な状況にあり、本人の合意を得ることが困難である場合{Environment.NewLine}③国の機関もしくは地方公共団体またはその委託を受けたものが、法令の定めにより遂行することに協力する必要な状況にあり、本人の同意を得ることにより、その遂行に支障を及ぼすおそれがある場合{Environment.NewLine}④その他、社会通念上、本連盟が必要と判断した状況にあり、本人の同意を得ることが困難である場合{Environment.NewLine}⑤利用者情報を個人が識別されない形式のデータに加工した場合";
        public static readonly string Article10 = $"本プライバシーポリシーは、本サービスの利用にのみ適用されます。本アプリケーションおよび本サービスからリンクする本連盟以外の事業者の外部URLアドレス、または個人のURLアドレス等における利用者情報の取り扱いについては、本連盟は責任を負いかねます。";
        public static readonly string Article11 = $"本サービスにおける利用者情報の取り扱いに関するお問い合わせ、ご相談はpr-app@scout.or.jpにてお受けいたします。メールにてお問い合わせください。";
        public static readonly string Article12 = $"1.本連盟は、法令の変更等に伴い、本プライバシーポリシーを変更することがあります。{Environment.NewLine}2.本連盟は、本アプリケーションのバージョンアップ等に伴って、利用者情報の取得項目の変更や追加、利用目的の変更、第三者提供等について変更がある場合において、重要なものについてはアップデート前またはアップデート時にあらためて利用者に同意の取得を求めます。";
    }
}
